# Width Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextBox..::..Width Property
TextBox Class See Also
---
Gets or sets the width of the TextBox.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double Width { get; set; }
```

Visual Basic
---
```text
Public Property Width As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Width {
	double get ();
	void set (double value);
}
```

# Remarks
The value for this property must be positive and cannot be Infinity. This value is interpreted in device-independent units (1/96th inch) measurement device-independent units. The default value is 200.
# See Also
TextBox Class
Autodesk.Revit.UI Namespace